if (!window.calendar_languages) {
    window.calendar_languages = {};
}
window.calendar_languages['ua-UA'] = {
    error_noview: 'Календар: Шаблон виду {0} не знайдений.',
    error_dateformat: 'Календар: невірний формат дати {0}. Повинно бути або "now" або "yyyy-mm-dd"',
    error_loadurl: 'Календар: не призначено URL для завантаження подій.',
    error_where: 'Календар: неправильна навігація {0}. Можна тільки "next", "prev" або  "today"',
    error_timedevide: 'Календар: Параметр дільник часу повинен ділити 60 на ціле число. наприклад 10, 15, 30',

    title_year: '{0}',
    title_month: '{0} {1}',
    title_week: '{0} тиждень року {1}',
    title_day: '{0}, {1} {2} {3}',

    week: 'Тиждень {0}',
    all_day: 'Весь день',
    time: 'Час',
    events: 'Події',
    before_time: 'Закінчуються перед часовою стрічкою',
    after_time: 'Закінчуються після часовоъ стрічки',

    m0: 'Січень',
    m1: 'Лютий',
    m2: 'Березень',
    m3: 'Квітень',
    m4: 'Травень',
    m5: 'Червень',
    m6: 'Липень',
    m7: 'Серпень',
    m8: 'Вересень',
    m9: 'Жовтень',
    m10: 'Листопад',
    m11: 'Грудень',

    ms0: 'Січ',
    ms1: 'Лют',
    ms2: 'Бер',
    ms3: 'Кві',
    ms4: 'Тра',
    ms5: 'Чер',
    ms6: 'Лип',
    ms7: 'Сер',
    ms8: 'Вер',
    ms9: 'Жов',
    ms10: 'Лис',
    ms11: 'Гру',

    d0: 'Неділя',
    d1: 'Понеділок',
    d2: 'Вівторок',
    d3: 'Середа',
    d4: 'Четвер',
    d5: 'Пятниця',
    d6: 'Субота',

    easter: 'Великдень',
    easterMonday: 'Великодній понеділок',

    first_day: 1,
    week_numbers_iso_8601: true,

    holidays: {
        '01-01': 'Новий рік',
        '02-01>06-01': 'Новорічні канікули',
        '07-01': 'Різдво Христове',
        '08-01': 'Новорічні канікули',
        '23-02': 'День захисника Вітчизни',
        '08-03': 'Міжнародний жіночий день',
        '01-05': 'Свято весни і праці',
        '09-05': 'День Перемоги'
    },

    timeButtonTitles: {
        year: 'Рік',
        month: 'Місяць',
        week: 'Тиждень',
        day: 'День'
    },

    navigationButtonTitles: {
        prev: 'Попередній',
        today: 'Сьогодні',
        next: 'Наступний'
    }
};
